# LastChangedBy Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingTooltipInfo..::..LastChangedBy Property
WorksharingTooltipInfo Class See Also
---
The user name of the most recent user who saved a user change of this element to the central model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string LastChangedBy { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LastChangedBy As String
	Get
```

Visual C++
---
```text
public:
property String^ LastChangedBy {
	String^ get ();
}
```

# See Also
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace